# ---------------------------------------------
# Applications
# ---------------------------------------------
# cask '1password'
# cask 'bartender'
# cask 'google-chrome'
# cask 'sublime-text'
# cask 'visual-studio-code'
# cask 'iterm2'
# cask 'zeplin'
# cask 'ngrok'
# cask 'fork'
# cask 'vlc'
# cask 'transmission'
# cask 'tableplus

# ---------------------------------------------
# Development
# ---------------------------------------------
brew 'neovim'
brew 'node'
brew 'yarn'
brew 'python'
brew 'go'

# ---------------------------------------------
# Operations
# ---------------------------------------------
cask 'docker'
cask 'google-cloud-sdk'
brew 'derailed/k9s/k9s'
brew 'kustomize'
brew 'kubeseal'
brew 'argocd'

# ---------------------------------------------
# Utilities
# ---------------------------------------------
brew 'bat'      # A better cat
brew 'tree'     # List directories as a tree
brew 'fzf'      # Fuzzy search
brew 'jq'       # Toolkit for JSON processing
brew 'httpie'   # Toolkit for HTTP requests
brew 'step'     # Toolkit for authentication

# ---------------------------------------------
# Android
# ---------------------------------------------
brew 'scrcpy'   # Mirror phone to laptop
