tap "xwmx/taps"
tap "homebrew/cask-fonts"

# ---------------------------------------------
# Applications
# ---------------------------------------------
cask 'google-chrome'
cask 'google-drive'

# Productivity
cask 'notion'
cask 'sublime-text'
cask 'linear-linear'
cask 'figma'

# Communication
cask 'slack'
cask 'discord'
cask 'zoom'
cask 'mimestream'
cask 'whatsapp'

# Leisure
cask 'calibre'
cask 'transmission'
cask 'vlc'

# Utilities
cask '1password'        # Password manager
cask 'grandperspective' # Analyse disk usage
cask 'tunnelblick'      # OpenVPN client
cask 'bartender'        # Hide icons in menu bar
cask 'stats'            # Show CPU/RAM/Network in menu bar
cask 'rectangle'        # Window manager

# Fonts
brew 'font-fira-code'   # Font

# ---------------------------------------------
# Development
# ---------------------------------------------
cask 'raycast'   # Advanced MacOs launcher
cask 'fig'        # Advanced CLI intellisense

# IDEs
cask 'visual-studio-code' # IDE
cask 'tableplus'          # Database client
cask 'mongodb-compass'    # MongoDB client
cask 'fork'               # Git client
cask 'boop'               # Programming util

# Programming languages
brew 'n' # node version manager
brew 'deno'
brew 'yarn'
brew 'python'
brew 'go'

# Mobile development
brew 'scrcpy' # Mirror phone to laptop

# ---------------------------------------------
# Operations
# ---------------------------------------------
cask 'docker'
cask 'google-cloud-sdk'

# Kubernetes
brew 'minikube'  # Local Kubernetes cluster
brew 'skaffold'  # Local Kubernetes development tool
brew 'k9s'       # Better Kubernetes CLI
brew 'kustomize' # Kubernetes configuration management
brew 'helm'      # Kubernetes configuration management
brew 'dive'      # Troubleshoot Docker images

# ---------------------------------------------
# Terminal
# ---------------------------------------------
cask 'iterm2'    # Better terminal
cask 'ngrok'     # Expose local servers
cask 'gpg-suite' # Sign git commits

brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'

brew 'openconnect' # VPN utils
brew 'coreutils'   # GNU utils
brew 'neovim'      # Better vim
brew 'bat'         # Better cat
brew 'ripgrep'     # Better grep
brew 'gh'          # GitHub CLI
brew 'tree'        # List directories as a tree
brew 'fzf'         # Fuzzy search
brew 'jq'          # Toolkit for JSON processing
brew 'httpie'      # Toolkit for HTTP requests
