tap "xwmx/taps"

# ---------------------------------------------
# Applications
# ---------------------------------------------
cask 'google-chrome'
cask 'google-drive'
cask 'sublime-text'
cask 'notion'
cask 'discord'
cask 'linear-linear'
cask 'figma'

cask 'whatsapp'
cask 'transmission'
cask 'vlc'
cask 'calibre'
cask 'adobe-digital-editions'

# ---------------------------------------------
# Development
# ---------------------------------------------
cask 'visual-studio-code' # IDE
cask 'tableplus' # Database client
cask 'fork'      # Git client
cask 'boop'      # Programming util

brew 'node'
brew 'deno'
brew 'yarn'
brew 'python'
brew 'go'

# ---------------------------------------------
# Operations
# ---------------------------------------------
cask 'docker'
cask 'google-cloud-sdk'

brew 'minikube'  # Local Kubernetes cluster
brew 'skaffold'  # Local Kubernetes development tool
brew 'k9s'       # Better Kubernetes CLI
brew 'kustomize' # Kubernetes configuration management
brew 'dive'      # Troubleshoot Docker images

# ---------------------------------------------
# Utilities
# ---------------------------------------------
cask 'flycut'           # Better copy-paste
cask '1password'        # Password manager
cask 'grandperspective' # Analyse disk usage
cask 'tunnelblick'      # OpenVPN client
cask 'rectangle'        # Window manager
cask 'stats'            # Show CPU/RAM/Network in menu bar
cask 'bartender'        # Hide icons in menu bar

brew 'watch'

# ---------------------------------------------
# Terminal
# ---------------------------------------------
cask 'iterm2'  # Better terminal
cask 'ngrok'   # Expose local servers

brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'

brew 'coreutils' # GNU utils
brew 'neovim'    # Better vim
brew 'bat'       # Better cat
brew 'ripgrep'   # Better grep
brew 'gh'        # GitHub CLI
brew 'tree'      # List directories as a tree
brew 'fzf'       # Fuzzy search
brew 'jq'        # Toolkit for JSON processing
brew 'httpie'    # Toolkit for HTTP requests

# ---------------------------------------------
# Android
# ---------------------------------------------
brew 'scrcpy' # Mirror phone to laptop
